In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
ser1 = Series(np.arange(3), index=['a', 'b','c'])
ser1

a    0
b    1
c    2
dtype: int64

In [5]:
ser1 = 2*ser1
ser1

a    0
b    2
c    4
dtype: int64

In [6]:
ser1['b']

2

In [7]:
ser1[1]

2

In [8]:
ser1[0:3]

a    0
b    2
c    4
dtype: int64

In [9]:
ser1[['a', 'b']]

a    0
b    2
dtype: int64

In [10]:
# filter using boolean logic
ser1[ser1 > 3]

c    4
dtype: int64

In [11]:
ser1[ser1 > 3]  =10
ser1

a     0
b     2
c    10
dtype: int64

In [12]:
# Selecting entries from Data Frames
dframe = DataFrame(np.arange(25).reshape(5,5), index=['NYC', 'LA', 'SA', 'CAL', 'CHI'], 
                   columns=['A', 'B', 'C', 'D', 'E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SA   10  11  12  13  14
CAL  15  16  17  18  19
CHI  20  21  22  23  24

In [13]:
# select by col name
dframe['B']

NYC     1
LA      6
SA     11
CAL    16
CHI    21
Name: B, dtype: int64

In [14]:
# select a set of columns
dframe[['A','B']]

      A   B
NYC   0   1
LA    5   6
SA   10  11
CAL  15  16
CHI  20  21

In [15]:
# using boolean logic
dframe[dframe['C'] > 8]

      A   B   C   D   E
SA   10  11  12  13  14
CAL  15  16  17  18  19
CHI  20  21  22  23  24

In [24]:
dframe[dframe['D'] > 3]

      A   B   C   D   E
LA    5   6   7   8   9
SA   10  11  12  13  14
CAL  15  16  17  18  19
CHI  20  21  22  23  24